{
  "exercises": [
    {
      "name": "Lat Pulldown",
      "image": "Lat Pulldown.png",
      "bodyParts": ["Back", "Biceps", "Shoulders"],
      "description": "Sit at the lat pulldown machine with your knees under the pads. Grip the bar slightly wider than shoulder-width. Pull the bar down to your upper chest while keeping your back straight. Slowly return to the starting position."
    },
    {
      "name": "Cable Row",
      "image": "Cable Row.png",
      "bodyParts": ["Back", "Biceps", "Core"],
      "description": "Sit at the cable row machine with your feet on the platform. Grab the handle and pull it towards your abdomen while keeping your back straight. Squeeze your shoulder blades together at the end of the movement."
    },
    {
      "name": "Hammer Curl",
      "image": "Hammer Curl.png",
      "bodyParts": ["Biceps", "Forearms"],
      "description": "Stand with dumbbells in each hand, palms facing your body. Keep your elbows close to your torso and curl the weights while maintaining the neutral grip. Lower the weights slowly."
    },
    {
      "name": "EZ Bar Curl",
      "image": "EZ Bar Curl.png",
      "bodyParts": ["Biceps", "Forearms"],
      "description": "Stand with feet shoulder-width apart, holding an EZ bar with an underhand grip. Curl the bar up while keeping your elbows close to your body. Lower the bar slowly with control."
    },
    {
      "name": "Bodyweight Squats",
      "image": "Bodyweight Squats.png",
      "bodyParts": ["Quadriceps", "Glutes", "Core"],
      "description": "Stand with feet shoulder-width apart. Lower your body by bending your knees and pushing your hips back. Keep your chest up and back straight. Return to standing position."
    },
    {
      "name": "Glute Bridge",
      "image": "Glute Bridge.png",
      "bodyParts": ["Glutes", "Hamstrings", "Core"],
      "description": "Lie on your back with knees bent and feet flat on the floor. Lift your hips up until your body forms a straight line from shoulders to knees. Squeeze your glutes at the top."
    },
    {
      "name": "Kettlebell Swings",
      "image": "Kettlebell Swings.png",
      "bodyParts": ["Glutes", "Hamstrings", "Core", "Shoulders"],
      "description": "Stand with feet wider than shoulder-width, holding a kettlebell with both hands. Hinge at the hips and swing the kettlebell between your legs. Thrust your hips forward to swing the kettlebell up to chest height."
    },
    {
      "name": "Bicycle Crunches",
      "image": "Bicycle Crunches.png",
      "bodyParts": ["Abs", "Obliques"],
      "description": "Lie on your back with hands behind your head. Bring your knees up and perform a bicycle pedaling motion while touching your elbow to the opposite knee. Keep your lower back pressed to the floor."
    },
    {
      "name": "Calf Raise",
      "image": "Calf Raise.png",
      "bodyParts": ["Calves"],
      "description": "Stand on the edge of a step or platform with your heels hanging off. Raise your heels as high as possible, then lower them below the platform level. Keep your knees straight throughout the movement."
    },
    {
      "name": "Bodyweight Lunges",
      "image": "Bodyweight Lunges.png",
      "bodyParts": ["Quadriceps", "Glutes", "Hamstrings"],
      "description": "Stand with feet together. Step forward with one leg and lower your body until both knees are bent at 90 degrees. Push back to the starting position and repeat with the other leg."
    },
    {
      "name": "Bird Dog",
      "image": "Bird Dog.png",
      "bodyParts": ["Core", "Back", "Glutes"],
      "description": "Start on all fours. Extend one arm forward and the opposite leg back while keeping your back straight. Hold briefly, then return to the starting position and switch sides."
    },
    {
      "name": "Plank",
      "image": "Plank.png",
      "bodyParts": ["Core", "Shoulders", "Back"],
      "description": "Start in a push-up position with your forearms on the ground. Keep your body in a straight line from head to heels. Hold this position while engaging your core muscles."
    },
    {
      "name": "Chest Press Machine",
      "image": "Chest Press Machine.png",
      "bodyParts": ["Chest", "Triceps", "Shoulders"],
      "description": "Sit at the chest press machine with your back flat against the pad. Grip the handles and push forward until your arms are extended. Slowly return to the starting position."
    },
    {
      "name": "Pec Deck Machine",
      "image": "Pec Deck Machine.png",
      "bodyParts": ["Chest", "Shoulders"],
      "description": "Sit at the pec deck machine with your back flat against the pad. Place your forearms on the pads and bring them together in front of your chest. Slowly return to the starting position."
    },
    {
      "name": "Triceps Pushdown",
      "image": "Triceps Pushdown (Cable).png",
      "bodyParts": ["Triceps"],
      "description": "Stand at the cable machine with a straight bar attachment. Grip the bar with hands shoulder-width apart. Keep your elbows close to your body and push the bar down until your arms are fully extended."
    },
    {
      "name": "Face Pulls",
      "image": "placeholder.png",
      "bodyParts": ["Upper Back", "Rear Deltoids", "Rotator Cuff"],
      "description": "Attach a rope to a cable machine at chest height. Grab the rope with both hands and step back. Pull the rope towards your face while keeping your elbows high. Squeeze your shoulder blades together at the end of the movement."
    },
    {
      "name": "Lateral Raises",
      "image": "placeholder.png",
      "bodyParts": ["Shoulders", "Upper Back"],
      "description": "Stand with dumbbells in each hand at your sides. Raise your arms out to the sides until they are parallel to the floor. Keep your elbows slightly bent and lower the weights slowly."
    },
    {
      "name": "Shoulder Press Machine",
      "image": "placeholder.png",
      "bodyParts": ["Shoulders", "Triceps", "Upper Chest"],
      "description": "Sit at the shoulder press machine with your back flat against the pad. Grip the handles and press upward until your arms are fully extended. Lower the weight slowly with control."
    },
    {
      "name": "Leg Press",
      "image": "placeholder.png",
      "bodyParts": ["Quadriceps", "Hamstrings", "Glutes"],
      "description": "Sit at the leg press machine with your back flat against the pad. Place your feet shoulder-width apart on the platform. Push the platform away by extending your legs, then slowly return to the starting position."
    },
    {
      "name": "Leg Extension",
      "image": "placeholder.png",
      "bodyParts": ["Quadriceps"],
      "description": "Sit at the leg extension machine with your back against the pad. Place your ankles under the padded bar. Extend your legs until they are straight, then slowly lower the weight back to the starting position."
    },
    {
      "name": "Leg Curl",
      "image": "placeholder.png",
      "bodyParts": ["Hamstrings"],
      "description": "Lie face down on the leg curl machine with your ankles under the padded bar. Curl your legs up as far as possible, then slowly lower the weight back to the starting position."
    },
    {
      "name": "Seated Row",
      "image": "placeholder.png",
      "bodyParts": ["Back", "Biceps", "Rear Deltoids"],
      "description": "Sit at the seated row machine with your chest against the pad. Grab the handles and pull them towards your abdomen while keeping your back straight. Squeeze your shoulder blades together at the end of the movement."
    },
    {
      "name": "Preacher Curl",
      "image": "placeholder.png",
      "bodyParts": ["Biceps"],
      "description": "Sit at the preacher curl bench with your upper arms resting on the pad. Hold an EZ bar or dumbbells with an underhand grip. Curl the weight up while keeping your upper arms stationary. Lower the weight slowly."
    },
    {
      "name": "Cable Crunch",
      "image": "placeholder.png",
      "bodyParts": ["Abs"],
      "description": "Kneel in front of a cable machine with the rope attachment at head height. Hold the rope behind your head. Crunch forward by contracting your abs, then slowly return to the starting position."
    },
    {
      "name": "Hanging Leg Raise",
      "image": "placeholder.png",
      "bodyParts": ["Abs", "Hip Flexors"],
      "description": "Hang from a pull-up bar with your arms fully extended. Raise your legs until they are parallel to the floor, keeping them straight. Lower your legs slowly with control."
    },
    {
      "name": "Mountain Climbers",
      "image": "placeholder.png",
      "bodyParts": ["Core", "Shoulders", "Hip Flexors"],
      "description": "Start in a push-up position. Bring one knee towards your chest, then quickly switch legs in a running motion. Keep your core engaged and back straight throughout the movement."
    },
    {
      "name": "Push-ups",
      "image": "placeholder.png",
      "bodyParts": ["Chest", "Triceps", "Shoulders", "Core"],
      "description": "Start in a plank position with hands slightly wider than shoulder-width. Lower your body until your chest nearly touches the floor, then push back up to the starting position. Keep your core engaged and back straight."
    },
    {
      "name": "Pull-ups",
      "image": "placeholder.png",
      "bodyParts": ["Back", "Biceps", "Shoulders"],
      "description": "Hang from a pull-up bar with hands slightly wider than shoulder-width. Pull your body up until your chin clears the bar, then lower yourself back down with control. Keep your core engaged throughout."
    },
    {
      "name": "Dips",
      "image": "placeholder.png",
      "bodyParts": ["Chest", "Triceps", "Shoulders"],
      "description": "Grip the parallel bars and lift yourself up. Lower your body by bending your elbows until your shoulders are below your elbows, then push back up to the starting position. Keep your chest up and core engaged."
    },
    {
      "name": "Step-ups",
      "image": "placeholder.png",
      "bodyParts": ["Quadriceps", "Glutes", "Hamstrings"],
      "description": "Stand in front of a bench or step. Step up with one foot, then bring the other foot up. Step back down with the same foot, then repeat with the other leg. Keep your chest up and core engaged."
    },
    {
      "name": "Wall Sit",
      "image": "placeholder.png",
      "bodyParts": ["Quadriceps", "Glutes"],
      "description": "Stand with your back against a wall. Slide down until your thighs are parallel to the floor and your knees are at 90 degrees. Hold this position while keeping your back flat against the wall."
    },
    {
      "name": "Superman Hold",
      "image": "placeholder.png",
      "bodyParts": ["Lower Back", "Glutes", "Shoulders"],
      "description": "Lie face down on the floor with arms extended overhead. Lift your arms, chest, and legs off the floor simultaneously. Hold this position while keeping your neck in a neutral position."
    },
    {
      "name": "High Knees",
      "image": "placeholder.png",
      "bodyParts": ["Core", "Hip Flexors", "Cardiovascular"],
      "description": "Stand with feet hip-width apart. Run in place while bringing your knees up as high as possible. Keep your back straight and core engaged. Pump your arms to increase intensity."
    },
    {
      "name": "Jumping Jacks",
      "image": "placeholder.png",
      "bodyParts": ["Cardiovascular", "Shoulders", "Legs"],
      "description": "Start with feet together and arms at your sides. Jump while spreading your legs and raising your arms overhead. Jump back to the starting position. Keep your core engaged throughout."
    },
    {
      "name": "Burpees",
      "image": "placeholder.png",
      "bodyParts": ["Full Body", "Cardiovascular"],
      "description": "Start in a standing position. Drop into a squat position with hands on the floor. Kick your feet back into a push-up position. Do a push-up, then jump your feet back to the squat position. Jump up with arms overhead."
    },
    {
      "name": "Skaters",
      "image": "placeholder.png",
      "bodyParts": ["Glutes", "Quadriceps", "Cardiovascular"],
      "description": "Start with feet shoulder-width apart. Jump to the right, landing on your right foot while crossing your left foot behind. Immediately jump to the left, landing on your left foot. Keep your chest up and core engaged."
    },
    {
      "name": "Yoga Flow",
      "image": "placeholder.png",
      "bodyParts": ["Full Body", "Flexibility"],
      "description": "A sequence of yoga poses that flow together, including downward dog, plank, upward dog, and child's pose. Focus on controlled breathing and proper form in each pose."
    },
    {
      "name": "Stretching",
      "image": "placeholder.png",
      "bodyParts": ["Full Body", "Flexibility"],
      "description": "A series of static stretches targeting major muscle groups. Hold each stretch for 15-30 seconds, focusing on proper form and controlled breathing. Never bounce during stretches."
    },
    {
      "name": "Foam Rolling",
      "image": "placeholder.png",
      "bodyParts": ["Full Body", "Recovery"],
      "description": "Use a foam roller to apply pressure to tight muscles. Roll slowly over each muscle group, pausing on tender spots. Focus on proper form and controlled breathing throughout."
    },
    {
      "name": "Walking",
      "image": "placeholder.png",
      "bodyParts": ["Cardiovascular", "Lower Body"],
      "description": "A low-impact cardiovascular exercise. Maintain good posture with shoulders back and core engaged. Swing your arms naturally and take comfortable strides."
    },
    {
      "name": "Clean and Press",
      "image": "placeholder.png",
      "bodyParts": ["Full Body", "Shoulders", "Legs"],
      "description": "Start with a barbell on the floor. Perform a clean by lifting the bar to your shoulders, then press it overhead. Lower the bar back to your shoulders, then to the floor. Keep your core engaged throughout."
    },
    {
      "name": "Box Jumps",
      "image": "placeholder.png",
      "bodyParts": ["Legs", "Core", "Cardiovascular"],
      "description": "Stand in front of a box or platform. Jump onto the box, landing softly with both feet. Step or jump back down and repeat. Keep your chest up and core engaged throughout."
    },
    {
      "name": "Medicine Ball Slams",
      "image": "placeholder.png",
      "bodyParts": ["Full Body", "Core", "Cardiovascular"],
      "description": "Hold a medicine ball overhead. Slam it down to the ground with force, then catch it on the bounce. Keep your core engaged and back straight throughout the movement."
    },
    {
      "name": "Rope Climbs",
      "image": "placeholder.png",
      "bodyParts": ["Upper Body", "Core", "Grip"],
      "description": "Grip the rope with both hands and feet. Use your arms and legs to climb up the rope. Keep your core engaged and maintain proper form throughout the movement."
    },
    {
      "name": "Dragon Flags",
      "image": "placeholder.png",
      "bodyParts": ["Core", "Hip Flexors"],
      "description": "Lie on a bench and grip it behind your head. Lift your entire body up until it's vertical, then lower it back down with control. Keep your body straight throughout the movement."
    },
    {
      "name": "Battle Ropes",
      "image": "placeholder.png",
      "bodyParts": ["Upper Body", "Core", "Cardiovascular"],
      "description": "Hold the ends of battle ropes with both hands. Create waves in the ropes by moving your arms up and down. Keep your core engaged and maintain proper form throughout."
    },
    {
      "name": "Jump Rope",
      "image": "placeholder.png",
      "bodyParts": ["Cardiovascular", "Calves", "Coordination"],
      "description": "Hold the jump rope handles and swing it over your head. Jump over the rope as it comes around. Keep your core engaged and maintain a steady rhythm."
    },
    {
      "name": "Russian Twists",
      "image": "placeholder.png",
      "bodyParts": ["Core", "Obliques"],
      "description": "Sit on the floor with knees bent and feet elevated. Hold a weight or medicine ball and twist your torso from side to side. Keep your back straight and core engaged."
    },
    {
      "name": "Bent Over Rows",
      "image": "placeholder.png",
      "bodyParts": ["Back", "Biceps", "Rear Deltoids"],
      "description": "Stand with feet shoulder-width apart, holding a barbell or dumbbells. Bend at the hips and keep your back straight. Pull the weight up to your abdomen, then lower it with control."
    },
    {
      "name": "Overhead Press",
      "image": "placeholder.png",
      "bodyParts": ["Shoulders", "Triceps", "Upper Chest"],
      "description": "Stand with feet shoulder-width apart, holding a barbell or dumbbells at shoulder height. Press the weight overhead until your arms are fully extended. Lower the weight with control."
    },
    {
      "name": "Bulgarian Split Squats",
      "image": "placeholder.png",
      "bodyParts": ["Quadriceps", "Glutes", "Hamstrings"],
      "description": "Stand with one foot on a bench behind you. Lower your body until your front thigh is parallel to the floor. Push back up to the starting position. Keep your chest up and core engaged."
    },
    {
      "name": "Romanian Deadlifts",
      "image": "placeholder.png",
      "bodyParts": ["Hamstrings", "Glutes", "Lower Back"],
      "description": "Stand with feet shoulder-width apart, holding a barbell or dumbbells. Hinge at the hips and lower the weight while keeping your back straight. Return to the starting position by squeezing your glutes."
    },
    {
      "name": "Weighted Plank",
      "image": "placeholder.png",
      "bodyParts": ["Core", "Shoulders", "Back"],
      "description": "Start in a plank position with a weight plate on your back. Hold the position while keeping your body in a straight line from head to heels. Keep your core engaged throughout."
    },
    {
      "name": "Weighted Pull-Ups",
      "image": "placeholder.png",
      "bodyParts": ["Back", "Biceps", "Shoulders"],
      "description": "Perform pull-ups with additional weight attached to your body. Pull your body up until your chin clears the bar, then lower yourself back down with control. Keep your core engaged throughout."
    },
    {
      "name": "Weighted Dips",
      "image": "placeholder.png",
      "bodyParts": ["Chest", "Triceps", "Shoulders"],
      "description": "Perform dips with additional weight attached to your body. Lower your body by bending your elbows, then push back up to the starting position. Keep your chest up and core engaged."
    },
    {
      "name": "Push Press",
      "image": "placeholder.png",
      "bodyParts": ["Shoulders", "Legs", "Core"],
      "description": "Start with a barbell at shoulder height. Dip slightly with your legs, then explosively press the weight overhead. Lower the weight back to your shoulders with control."
    },
    {
      "name": "Front Squat",
      "image": "placeholder.png",
      "bodyParts": ["Quadriceps", "Core", "Upper Back"],
      "description": "Hold a barbell in the front rack position. Squat down until your thighs are parallel to the floor, then push back up to the starting position. Keep your chest up and core engaged."
    },
    {
      "name": "Glute Ham Raise",
      "image": "placeholder.png",
      "bodyParts": ["Hamstrings", "Glutes", "Lower Back"],
      "description": "Position yourself in a glute ham raise machine. Lower your body until it's parallel to the floor, then raise it back up by contracting your hamstrings and glutes. Keep your core engaged throughout."
    },
    {
      "name": "Hip Abduction Machine",
      "image": "placeholder.png",
      "bodyParts": ["Hip Abductors", "Glutes"],
      "description": "Sit at the hip abduction machine with your legs against the pads. Push your legs outward against the resistance, then slowly return to the starting position. Keep your back straight throughout."
    },
    {
      "name": "Hip Adduction Machine",
      "image": "placeholder.png",
      "bodyParts": ["Hip Adductors", "Inner Thighs"],
      "description": "Sit at the hip adduction machine with your legs against the pads. Bring your legs together against the resistance, then slowly return to the starting position. Keep your back straight throughout."
    },
    {
      "name": "Seated Knee Extensions",
      "image": "placeholder.png",
      "bodyParts": ["Quadriceps"],
      "description": "Sit at the knee extension machine with your back against the pad. Place your ankles under the padded bar. Extend your legs until they are straight, then slowly lower the weight back to the starting position."
    },
    {
      "name": "Standing Calf Raises",
      "image": "placeholder.png",
      "bodyParts": ["Calves"],
      "description": "Stand on a step or platform with your heels hanging off. Raise your heels as high as possible, then lower them below the platform level. Keep your knees straight throughout the movement."
    },
    {
      "name": "Seated Russian Twists",
      "image": "placeholder.png",
      "bodyParts": ["Core", "Obliques"],
      "description": "Sit on the floor with knees bent and feet elevated. Hold a weight or medicine ball and twist your torso from side to side. Keep your back straight and core engaged."
    },
    {
      "name": "Standing Side Crunches",
      "image": "placeholder.png",
      "bodyParts": ["Obliques", "Core"],
      "description": "Stand with feet shoulder-width apart. Bring one knee up while bringing the opposite elbow down to meet it. Return to the starting position and repeat on the other side. Keep your core engaged throughout."
    },
    {
      "name": "Marching in Place",
      "image": "placeholder.png",
      "bodyParts": ["Cardiovascular", "Hip Flexors"],
      "description": "Stand with feet hip-width apart. Lift your knees up one at a time in a marching motion. Keep your back straight and core engaged. Pump your arms to increase intensity."
    },
    {
      "name": "Cycling",
      "image": "placeholder.png",
      "bodyParts": ["Cardiovascular", "Legs"],
      "description": "Pedal on a stationary bike or outdoor bicycle. Maintain proper posture with your back straight and core engaged. Adjust resistance and speed according to your fitness level."
    },
    {
      "name": "Sit-Ups",
      "image": "placeholder.png",
      "bodyParts": ["Abs", "Hip Flexors"],
      "description": "Lie on your back with knees bent and feet flat on the floor. Place your hands behind your head and curl your upper body up towards your knees. Lower back down with control."
    },
    {
      "name": "Dumbbell Squat",
      "image": "placeholder.png",
      "bodyParts": ["Quadriceps", "Glutes", "Core"],
      "description": "Stand with feet shoulder-width apart, holding dumbbells at your sides. Lower your body by bending your knees and pushing your hips back. Keep your chest up and back straight. Return to standing position."
    },
    {
      "name": "Dumbbell Bench Press",
      "image": "placeholder.png",
      "bodyParts": ["Chest", "Triceps", "Shoulders"],
      "description": "Lie on a bench with dumbbells in each hand. Press the weights up until your arms are fully extended. Lower the weights with control, keeping your elbows at a 45-degree angle."
    },
    {
      "name": "Dumbbell Rows",
      "image": "placeholder.png",
      "bodyParts": ["Back", "Biceps", "Rear Deltoids"],
      "description": "Place one hand and knee on a bench, holding a dumbbell in the other hand. Pull the weight up to your side, keeping your elbow close to your body. Lower the weight with control."
    },
    {
      "name": "Dumbbell Shoulder Press",
      "image": "placeholder.png",
      "bodyParts": ["Shoulders", "Triceps", "Upper Chest"],
      "description": "Stand or sit with dumbbells at shoulder height. Press the weights overhead until your arms are fully extended. Lower the weights with control, keeping your core engaged."
    },
    {
      "name": "Dumbbell Curls",
      "image": "placeholder.png",
      "bodyParts": ["Biceps", "Forearms"],
      "description": "Stand with dumbbells in each hand, palms facing forward. Curl the weights up while keeping your elbows close to your body. Lower the weights slowly with control."
    },
    {
      "name": "Triceps Extensions",
      "image": "placeholder.png",
      "bodyParts": ["Triceps"],
      "description": "Stand or sit with a dumbbell in both hands overhead. Lower the weight behind your head by bending your elbows. Extend your arms back to the starting position."
    },
    {
      "name": "Chin-Ups",
      "image": "placeholder.png",
      "bodyParts": ["Back", "Biceps", "Shoulders"],
      "description": "Hang from a pull-up bar with hands shoulder-width apart and palms facing you. Pull your body up until your chin clears the bar, then lower yourself back down with control. Keep your core engaged throughout."
    },
    {
      "name": "Barbell Squat",
      "image": "placeholder.png",
      "bodyParts": ["Quadriceps", "Glutes", "Core"],
      "description": "Stand with feet shoulder-width apart, holding a barbell on your upper back. Lower your body by bending your knees and pushing your hips back. Keep your chest up and back straight. Return to standing position."
    },
    {
      "name": "Barbell Bench Press",
      "image": "placeholder.png",
      "bodyParts": ["Chest", "Triceps", "Shoulders"],
      "description": "Lie on a bench with a barbell at chest height. Press the bar up until your arms are fully extended. Lower the bar with control, keeping your elbows at a 45-degree angle."
    },
    {
      "name": "Barbell Rows",
      "image": "placeholder.png",
      "bodyParts": ["Back", "Biceps", "Rear Deltoids"],
      "description": "Stand with feet shoulder-width apart, holding a barbell. Bend at the hips and keep your back straight. Pull the weight up to your abdomen, then lower it with control."
    },
    {
      "name": "Barbell Curls",
      "image": "placeholder.png",
      "bodyParts": ["Biceps", "Forearms"],
      "description": "Stand with feet shoulder-width apart, holding a barbell with an underhand grip. Curl the bar up while keeping your elbows close to your body. Lower the bar slowly with control."
    },
    {
      "name": "Incline DB Press",
      "image": "placeholder.png",
      "bodyParts": ["Upper Chest", "Shoulders", "Triceps"],
      "description": "Lie on an incline bench with dumbbells in each hand. Press the weights up until your arms are fully extended. Lower the weights with control, keeping your elbows at a 45-degree angle."
    },
    {
      "name": "Cable Crossover",
      "image": "placeholder.png",
      "bodyParts": ["Chest", "Shoulders"],
      "description": "Stand between two cable machines with handles in each hand. Bring your hands together in front of your chest, then return to the starting position. Keep your core engaged throughout."
    },
    {
      "name": "Skull Crushers",
      "image": "placeholder.png",
      "bodyParts": ["Triceps"],
      "description": "Lie on a bench with a barbell or EZ bar. Lower the weight towards your forehead by bending your elbows. Extend your arms back to the starting position."
    },
    {
      "name": "Close-Grip Bench Press",
      "image": "placeholder.png",
      "bodyParts": ["Triceps", "Chest"],
      "description": "Lie on a bench with hands closer than shoulder-width on the barbell. Press the bar up until your arms are fully extended. Lower the bar with control, keeping your elbows close to your body."
    },
    {
      "name": "T-Bar Rows",
      "image": "placeholder.png",
      "bodyParts": ["Back", "Biceps", "Rear Deltoids"],
      "description": "Stand with feet shoulder-width apart, holding a T-bar. Bend at the hips and keep your back straight. Pull the weight up to your chest, then lower it with control."
    },
    {
      "name": "Reverse Fly",
      "image": "placeholder.png",
      "bodyParts": ["Rear Deltoids", "Upper Back"],
      "description": "Stand with feet shoulder-width apart, holding dumbbells. Bend at the hips and keep your back straight. Raise your arms out to the sides, then lower them with control."
    },
    {
      "name": "Preacher Curls",
      "image": "placeholder.png",
      "bodyParts": ["Biceps"],
      "description": "Sit at the preacher curl bench with your upper arms resting on the pad. Hold a barbell or dumbbells with an underhand grip. Curl the weight up while keeping your upper arms stationary. Lower the weight slowly."
    },
    {
      "name": "Triceps Pushdown",
      "image": "placeholder.png",
      "bodyParts": ["Triceps"],
      "description": "Stand at the cable machine with a straight bar attachment. Grip the bar with hands shoulder-width apart. Keep your elbows close to your body and push the bar down until your arms are fully extended."
    },
    {
      "name": "Wall Push-Ups",
      "image": "placeholder.png",
      "bodyParts": ["Chest", "Triceps", "Shoulders"],
      "description": "Stand facing a wall with feet shoulder-width apart. Place your hands on the wall slightly wider than shoulder-width. Bend your elbows to bring your chest towards the wall, then push back to the starting position. Keep your core engaged and back straight."
    },
    {
      "name": "Seated Row Machine",
      "image": "placeholder.png",
      "bodyParts": ["Back", "Biceps", "Rear Deltoids"],
      "description": "Sit at the seated row machine with your chest against the pad. Grab the handles and pull them towards your abdomen while keeping your back straight. Squeeze your shoulder blades together at the end of the movement."
    },
    {
      "name": "Lat Pulldown Machine",
      "image": "placeholder.png",
      "bodyParts": ["Back", "Biceps", "Shoulders"],
      "description": "Sit at the lat pulldown machine with your knees under the pads. Grip the bar slightly wider than shoulder-width. Pull the bar down to your upper chest while keeping your back straight. Slowly return to the starting position."
    },
    {
      "name": "Standing Toe Touch",
      "image": "placeholder.png",
      "bodyParts": ["Hamstrings", "Lower Back", "Core"],
      "description": "Stand with feet shoulder-width apart. Hinge at the hips and reach down to touch your toes while keeping your legs straight. Return to the starting position by engaging your core and glutes."
    },
    {
      "name": "Push-Ups (Knee)",
      "image": "placeholder.png",
      "bodyParts": ["Chest", "Triceps", "Shoulders", "Core"],
      "description": "Start in a plank position with your knees on the ground. Place your hands slightly wider than shoulder-width. Lower your body until your chest nearly touches the floor, then push back up to the starting position. Keep your core engaged and back straight."
    }
  ]
}
